In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:
#Let's make a dframe
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})

#Show
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.221318 -1.023959
1  X   beta -1.443659  1.126460
2  Y  alpha -0.119493  1.210513
3  Y   beta -0.710143 -0.236577
4  Z  alpha  1.388023  0.987382

In [3]:
#Now let's see how to use groupby

#Lets grab the dataset1 column and group it by the k1 key
group1 = dframe['dataset1'].groupby(dframe['k1'])

#Show the groupby object
group1

In [4]:
#Now we can perform operations on this particular group
group1.mean()

k1
X   -0.832488
Y   -0.414818
Z    1.388023
Name: dataset1, dtype: float64

In [5]:
# We can use group keys that are series as well

#For example:

#We'll make some arrays for use as keys
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

#Now using the data from dataset1, group the means by city and month
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB   -1.443659
    JAN   -0.119493
NY  FEB   -0.710143
    JAN    0.583353
Name: dataset1, dtype: float64

In [6]:
# let's see the original dframe again.
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.221318 -1.023959
1  X   beta -1.443659  1.126460
2  Y  alpha -0.119493  1.210513
3  Y   beta -0.710143 -0.236577
4  Z  alpha  1.388023  0.987382

In [7]:
# WE can also pass column names as group keys
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.832488  0.051250
Y  -0.414818  0.486968
Z   1.388023  0.987382

In [8]:
# Or multiple column names
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.221318 -1.023959
   beta  -1.443659  1.126460
Y  alpha -0.119493  1.210513
   beta  -0.710143 -0.236577
Z  alpha  1.388023  0.987382

In [9]:
# Another useful groupby method is getting the group sizes
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [10]:
# We can also iterate over groups

#For example:
for name,group in dframe.groupby('k1'):
    print("This is the %s group" %name)
    print(group)
    print('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha -0.221318 -1.023959
1  X   beta -1.443659  1.126460


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -0.119493  1.210513
3  Y   beta -0.710143 -0.236577


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha  1.388023  0.987382

In [11]:
# We can also iterate with multiple keys
for (k1,k2) , group in dframe.groupby(['k1','k2']):
    print("Key1 = %s Key2 = %s" %(k1,k2))
    print(group)
    print('\n')

Key1 = X Key2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha -0.221318 -1.023959


Key1 = X Key2 = beta
  k1    k2  dataset1  dataset2
1  X  beta -1.443659   1.12646


Key1 = Y Key2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha -0.119493  1.210513


Key1 = Y Key2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta -0.710143 -0.236577


Key1 = Z Key2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha  1.388023  0.987382

In [12]:
# A possibly useful tactic is creating a dictionary of the data pieces 
group_dict = dict(list(dframe.groupby('k1')))

#Show the group with X
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha -0.221318 -1.023959
1  X   beta -1.443659  1.126460

In [13]:
# We could have also chosen to do this with axis = 1

# Let's creat a dictionary for dtypes of objects!
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

#show
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -0.221318 -1.023959
 1 -1.443659  1.126460
 2 -0.119493  1.210513
 3 -0.710143 -0.236577
 4  1.388023  0.987382, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [14]:
# Next we'll learn how to use groupby with columns

In [15]:
# For example if we only wanted to group the dataset2 column with both sets of keys
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

dataset2_group.mean()

          dataset2
k1 k2
X  alpha -1.023959
   beta   1.126460
Y  alpha  1.210513
   beta  -0.236577
Z  alpha  0.987382

In [16]:
#Next we'll have a quick lesson on grouping with dictionaries and series!